app/controllers/articles_controller.rb

  def create
    @article = User.find(session[:current_user_id]).articles.build(params[:article])

    if @article.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `articles` (`comment_num`, `content`, `created_at`, `title`, `updated_at`, `user_id`, `view_num`) VALUES (0, '这里是文章内容', '2013-03-28 09:18:12', '文章一', '2013-03-28 09:18:12', NULL, 0)

  def index
    user = User.find(session[:current_user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def destroy
    Article.find(params[:id]).destroy
---
DELETE FROM `articles` WHERE `articles`.`id` = 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1

  def update
    @article = Article.find(params[:id])
    if @article.update_attributes(params[:article])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 37 LIMIT 1
UPDATE `articles` SET `content` = '新的博客内容 \r\n# 第一章\r\n你好\r\n## 第一节\r\n这里是第一节内容', `updated_at` = '2013-04-14 06:04:57' WHERE `articles`.`id` = 37