app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    if @user.save
---
INSERT INTO `users` (`about`, `created_at`, `email`, `name`, `pwd`, `updated_at`) VALUES ('', '2013-03-25 15:31:43', 'jiadongkai@gmail.com', 'tiemei', 'myfish2010', '2013-03-25 15:31:43')

  def login
    redirect_to session[:current_user] and return if session[:current_user]

    @user = User.new(params[:user])

    # TODO 这大段的逻辑应该放在Controler还是Model中合适?
    if @user.pwd.blank? || @user.name.blank?
---
SELECT `users`.* FROM `users` WHERE (name = NULL) LIMIT 1